; domain
(define (domain courses)

    ;remove requirements that are not needed
    (:requirements :strips :typing :fluents :adl)

    (:types
        course course-level week unit - object
        english-literacy expressive-arts health-wellbeing maths-numeracy languages sciences social-subjects technologies - course
        nq bge - course-level
        vark-type
        strategy 
        support-requirement
        support-received
        student
    )

    (:constants
        pomodoro - strategy
        week-one week-two week-three week-four week-five week-six week-seven week-eight - week
        unit-one unit-two unit-three unit-four - unit
    )
    
    (:predicates
        (uses-strategy ?s - student ?t - strategy)
        (student-vark-type ?s - student ?v - vark-type)
        (has-received-support ?s - student ?r - support-received)
        (takes-course ?s - student ?c - course ?l - course-level)
        (finished-course ?s - student ?c - course ?l - course-level)
        (grade-a ?s - student ?c - course ?l - course-level)
        (grade-b ?s - student ?c - course ?l - course-level)
        (grade-c ?s - student ?c - course ?l - course-level)
        (grade-d ?s - student ?c - course ?l - course-level)
        (grade-f ?s - student ?c - course ?l - course-level)
        (grade-p ?s - student ?c - course ?l - course-level)
        (done-week-one ?s - student ?c - course ?l - course-level)
        (done-week-two ?s - student ?c - course ?l - course-level)
        (done-week-three ?s - student ?c - course ?l - course-level)
        (done-week-four ?s - student ?c - course ?l - course-level)
        (done-week-five ?s - student ?c - course ?l - course-level)
        (done-week-six ?s - student ?c - course ?l - course-level)
        (done-week-seven ?s - student ?c - course ?l - course-level)
        (done-week-eight ?s - student ?c - course ?l - course-level)
        (done-unit-one ?s - student ?c - course ?l - course-level)
        (done-unit-two ?s - student ?c - course ?l - course-level)
        (done-unit-three ?s - student ?c - course ?l - course-level)
        (done-unit-four ?s - student ?c - course ?l - course-level)

        (done-extra-curricular-one ?s - student ?c - course ?l - course-level)
        (done-extra-curricular-two ?s - student ?c - course ?l - course-level)
        (done-extra-curricular-three ?s - student ?c - course ?l - course-level)
        (done-extra-curricular-four ?s - student ?c - course ?l - course-level)
        (done-extra-curricular-five ?s - student ?c - course ?l - course-level)
        (done-extra-curricular-six ?s - student ?c - course ?l - course-level)
        (done-extra-curricular-seven ?s - student ?c - course ?l - course-level)
        (done-extra-curricular-eight ?s - student ?c - course ?l - course-level)

        (student-led ?c - course ?l - course-level)
    )

    (:functions
        (duration)
    )

    (:action do-extra-curricular-one
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (takes-course ?s ?c ?l)
            (or
                (grade-a ?s ?c ?l)
                (grade-b ?s ?c ?l)
            )
            (not
                (done-extra-curricular-one ?s ?c ?l)
            )
        )
        :effect (and 
            (done-extra-curricular-one ?s ?c ?l)
            (increase (duration) 60)
        )
    )

    (:action do-extra-curricular-two
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (takes-course ?s ?c ?l)
            (or
                (grade-a ?s ?c ?l)
                (grade-b ?s ?c ?l)
            )
            (not
                (done-extra-curricular-two ?s ?c ?l)
            )
            (done-extra-curricular-one ?s ?c ?l)
        )
        :effect (and 
            (done-extra-curricular-two ?s ?c ?l)
            (increase (duration) 60)
        )
    )

    (:action do-extra-curricular-three
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (takes-course ?s ?c ?l)
            (or
                (grade-a ?s ?c ?l)
                (grade-b ?s ?c ?l)
            )
            (not
                (done-extra-curricular-three ?s ?c ?l)
            )
            (done-extra-curricular-two ?s ?c ?l)
            (done-unit-one ?s ?c ?l)
        )
        :effect (and 
            (done-extra-curricular-three ?s ?c ?l)
            (increase (duration) 60)
        )
    )

    (:action do-extra-curricular-four
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (takes-course ?s ?c ?l)
            (or
                (grade-a ?s ?c ?l)
                (grade-b ?s ?c ?l)
            )
            (not
                (done-extra-curricular-four ?s ?c ?l)
            )
            (done-extra-curricular-three ?s ?c ?l)
            (done-unit-one ?s ?c ?l)
        )
        :effect (and 
            (done-extra-curricular-four ?s ?c ?l)
            (increase (duration) 60)
        )
    )

    (:action do-extra-curricular-five
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (takes-course ?s ?c ?l)
            (or
                (grade-a ?s ?c ?l)
                (grade-b ?s ?c ?l)
            )
            (not
                (done-extra-curricular-five ?s ?c ?l)
            )
            (done-extra-curricular-four ?s ?c ?l)
            (done-unit-two ?s ?c ?l)
        )
        :effect (and 
            (done-extra-curricular-five ?s ?c ?l)
            (increase (duration) 60)
        )
    )

    (:action do-extra-curricular-six
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (takes-course ?s ?c ?l)
            (or
                (grade-a ?s ?c ?l)
                (grade-b ?s ?c ?l)
            )
            (not
                (done-extra-curricular-six ?s ?c ?l)
            )
            (done-extra-curricular-five ?s ?c ?l)
            (done-unit-two ?s ?c ?l)
        )
        :effect (and 
            (done-extra-curricular-six ?s ?c ?l)
            (increase (duration) 60)
        )
    )

    (:action do-extra-curricular-seven
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (takes-course ?s ?c ?l)
            (or
                (grade-a ?s ?c ?l)
                (grade-b ?s ?c ?l)
            )
            (not
                (done-extra-curricular-seven ?s ?c ?l)
            )
            (done-extra-curricular-six ?s ?c ?l)
            (done-unit-three ?s ?c ?l)
        )
        :effect (and 
            (done-extra-curricular-seven ?s ?c ?l)
            (increase (duration) 60)
        )
    )

    (:action do-extra-curricular-eight
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (takes-course ?s ?c ?l)
            (or
                (grade-a ?s ?c ?l)
                (grade-b ?s ?c ?l)
            )
            (not
                (done-extra-curricular-eight ?s ?c ?l)
            )
            (done-extra-curricular-seven ?s ?c ?l)
            (done-unit-three ?s ?c ?l)
        )
        :effect (and 
            (done-extra-curricular-eight ?s ?c ?l)
            (increase (duration) 60)
        )
    )
    

    (:action take-unit-one
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (takes-course ?s ?c ?l)
            (not(done-unit-one ?s ?c ?l))
            (done-week-eight ?s ?c ?l)
        )
        :effect (and
            (increase (duration) 60)
            (done-unit-one ?s ?c ?l)
            (not(done-week-eight ?s ?c ?l))
            (not(done-week-seven ?s ?c ?l))
            (not(done-week-six ?s ?c ?l))
            (not(done-week-five ?s ?c ?l))
            (not(done-week-four ?s ?c ?l))
            (not(done-week-three ?s ?c ?l))
            (not(done-week-two ?s ?c ?l))
            (not(done-week-one ?s ?c ?l))
        )
    )

    (:action take-unit-two
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (takes-course ?s ?c ?l)
            (not(done-unit-two ?s ?c ?l))
            (done-unit-one ?s ?c ?l)
            (done-week-eight ?s ?c ?l)
        )
        :effect (and
            (increase (duration) 60)
            (done-unit-two ?s ?c ?l)
            (not(done-week-eight ?s ?c ?l))
            (not(done-week-seven ?s ?c ?l))
            (not(done-week-six ?s ?c ?l))
            (not(done-week-five ?s ?c ?l))
            (not(done-week-four ?s ?c ?l))
            (not(done-week-three ?s ?c ?l))
            (not(done-week-two ?s ?c ?l))
            (not(done-week-one ?s ?c ?l))
        )
    )

    (:action take-unit-three
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (takes-course ?s ?c ?l)
            (not(done-unit-three ?s ?c ?l))
            (done-unit-two ?s ?c ?l)
            (done-week-eight ?s ?c ?l)
        )
        :effect (and
            (increase (duration) 60)
            (done-unit-three ?s ?c ?l)
            (not(done-week-eight ?s ?c ?l))
            (not(done-week-seven ?s ?c ?l))
            (not(done-week-six ?s ?c ?l))
            (not(done-week-five ?s ?c ?l))
            (not(done-week-four ?s ?c ?l))
            (not(done-week-three ?s ?c ?l))
            (not(done-week-two ?s ?c ?l))
            (not(done-week-one ?s ?c ?l))
        )
    )

    (:action take-unit-four
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (takes-course ?s ?c ?l)
            (not(done-unit-four ?s ?c ?l))
            (done-unit-three ?s ?c ?l)
            (done-week-eight ?s ?c ?l)
        )
        :effect (and
            (increase (duration) 60)
            (done-unit-four ?s ?c ?l)
            (not(done-week-eight ?s ?c ?l))
            (not(done-week-seven ?s ?c ?l))
            (not(done-week-six ?s ?c ?l))
            (not(done-week-five ?s ?c ?l))
            (not(done-week-four ?s ?c ?l))
            (not(done-week-three ?s ?c ?l))
            (not(done-week-two ?s ?c ?l))
            (not(done-week-one ?s ?c ?l))
        )
    )

    (:action do-week-one
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (takes-course ?s ?c ?l)
            (not(done-week-one ?s ?c ?l))
        )
        :effect (and 
            (done-week-one ?s ?c ?l)
            (increase (duration) 360)
        )
    )

    (:action do-week-two
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (not(done-week-two ?s ?c ?l))
            (done-week-one ?s ?c ?l)
        )
        :effect (and 
            (done-week-two ?s ?c ?l)
            (increase (duration) 360)
        )
    )

    (:action do-week-three
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (not(done-week-three ?s ?c ?l))
            (done-week-two ?s ?c ?l)
        )
        :effect (and 
            (done-week-three ?s ?c ?l)
            (increase (duration) 360)
        )
    )

    (:action do-week-four
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (not(done-week-four ?s ?c ?l))
            (done-week-three ?s ?c ?l)
        )
        :effect (and 
            (done-week-four ?s ?c ?l)
            (increase (duration) 360)
        )
    )

    (:action do-week-five
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (not(done-week-five ?s ?c ?l))
            (done-week-four ?s ?c ?l)
        )
        :effect (and 
            (done-week-five ?s ?c ?l)
            (increase (duration) 360)
        )
    )

    (:action do-week-six
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (not(done-week-six ?s ?c ?l))
            (done-week-five ?s ?c ?l)
        )
        :effect (and 
            (done-week-six ?s ?c ?l)
            (increase (duration) 360)
        )
    )

    (:action do-week-seven
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (not(done-week-seven ?s ?c ?l))
            (done-week-six ?s ?c ?l)
        )
        :effect (and 
            (done-week-seven ?s ?c ?l)
            (increase (duration) 360)
        )
    )

    (:action do-week-eight
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (not(done-week-eight ?s ?c ?l))
            (done-week-seven ?s ?c ?l)
        )
        :effect (and 
            (done-week-eight ?s ?c ?l)
            (increase (duration) 360)
        )
    )
    
    (:action do-pomodoro
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (takes-course ?s ?c ?l)
            (uses-strategy ?s pomodoro)
        )
        :effect (and 
            (increase (duration) 720)
        )
    )
    
    
    (:action finish-course
        :parameters (?s - student ?c - course ?l - course-level)
        :precondition (and 
            (done-unit-four ?s ?c ?l)
            (takes-course ?s ?c ?l)
        )
        :effect (and 
            (finished-course ?s ?c ?l)
        )
    )
)

; problem
(define (problem sqa) (:domain courses)
    (:objects
        stewart - student
        adv-higher higher national-five national-four - nq
        year-one year-two year-three - bge
        english esol - english-literacy
        drama art-design music music-tech dance - expressive-arts
        phys-ed home-economics textiles - health-wellbeing
        maths numeracy lifeskills - maths-numeracy
        french german spanish italian latin mandarin cantonese gaelic urdu - languages
        biology chemistry physics landscape-gardening - sciences
        geography history modern-studies rmps philosophy politics - social-subjects
        admin-it business-management comp-sci design-manufacture graph-comm practical-woodwork pc-passport - technologies
        visualisation teamwork student-led-class inquiry-based-teaching technological-tools flex-seating summ-assessment form-assessment gamification project-based blended-learning interdisc-teaching - strategy
        adhd asc-asd dyslexia dyscalculia diff-attention-listening dysfluency reluct-selec-talk diff-understand-comm cerebral-palsy fibromyalgia hypermobility multiple-sclerosis spina-bifida tourettes attachment fight-flight freeze-fold low-level social-other deaf-hearing blind-visual - support-requirement
        none reduced-contact - support-received
        visual audio read-write kinaesthetic multimodal - vark-type
    )

    (:init
        (= (duration) 0)

        (takes-course stewart english national-five)
        (grade-b stewart english national-five)
        (uses-strategy stewart pomodoro)
        (has-received-support stewart none)
        (student-vark-type stewart multimodal)
    )

    (:goal
        (and
            (finished-course stewart english national-five)
        )
    )

    (:metric maximize
        (duration)
    )
)

; plan
1. (do-week-one stewart english national-five)
   added: (done-week-one stewart english national-five)
   changed: (duration) from 0 to 360
   goals met: 0 of 1
2. (do-week-two stewart english national-five)
   added: (done-week-two stewart english national-five)
   changed: (duration) from 360 to 720
   goals met: 0 of 1
3. (do-week-three stewart english national-five)
   added: (done-week-three stewart english national-five)
   changed: (duration) from 720 to 1080
   goals met: 0 of 1
4. (do-week-four stewart english national-five)
   added: (done-week-four stewart english national-five)
   changed: (duration) from 1080 to 1440
   goals met: 0 of 1
5. (do-week-five stewart english national-five)
   added: (done-week-five stewart english national-five)
   changed: (duration) from 1440 to 1800
   goals met: 0 of 1
6. (do-week-six stewart english national-five)
   added: (done-week-six stewart english national-five)
   changed: (duration) from 1800 to 2160
   goals met: 0 of 1
7. (do-week-seven stewart english national-five)
   added: (done-week-seven stewart english national-five)
   changed: (duration) from 2160 to 2520
   goals met: 0 of 1
8. (do-week-eight stewart english national-five)
   added: (done-week-eight stewart english national-five)
   changed: (duration) from 2520 to 2880
   goals met: 0 of 1
9. (take-unit-one stewart english national-five)
   deleted: (done-week-eight stewart english national-five) (done-week-seven stewart english national-five) (done-week-six stewart english national-five) (done-week-five stewart english national-five) (done-week-four stewart english national-five) (done-week-three stewart english national-five) (done-week-two stewart english national-five) (done-week-one stewart english national-five)
   added: (done-unit-one stewart english national-five)
   changed: (duration) from 2880 to 2940
   goals met: 0 of 1
10. (do-week-one stewart english national-five)
   added: (done-week-one stewart english national-five)
   changed: (duration) from 2940 to 3300
   goals met: 0 of 1
11. (do-week-two stewart english national-five)
   added: (done-week-two stewart english national-five)
   changed: (duration) from 3300 to 3660
   goals met: 0 of 1
12. (do-week-three stewart english national-five)
   added: (done-week-three stewart english national-five)
   changed: (duration) from 3660 to 4020
   goals met: 0 of 1
13. (do-week-four stewart english national-five)
   added: (done-week-four stewart english national-five)
   changed: (duration) from 4020 to 4380
   goals met: 0 of 1
14. (do-week-five stewart english national-five)
   added: (done-week-five stewart english national-five)
   changed: (duration) from 4380 to 4740
   goals met: 0 of 1
15. (do-week-six stewart english national-five)
   added: (done-week-six stewart english national-five)
   changed: (duration) from 4740 to 5100
   goals met: 0 of 1
16. (do-week-seven stewart english national-five)
   added: (done-week-seven stewart english national-five)
   changed: (duration) from 5100 to 5460
   goals met: 0 of 1
17. (do-week-eight stewart english national-five)
   added: (done-week-eight stewart english national-five)
   changed: (duration) from 5460 to 5820
   goals met: 0 of 1
18. (take-unit-two stewart english national-five)
   deleted: (done-week-eight stewart english national-five) (done-week-seven stewart english national-five) (done-week-six stewart english national-five) (done-week-five stewart english national-five) (done-week-four stewart english national-five) (done-week-three stewart english national-five) (done-week-two stewart english national-five) (done-week-one stewart english national-five)
   added: (done-unit-two stewart english national-five)
   changed: (duration) from 5820 to 5880
   goals met: 0 of 1
19. (do-week-one stewart english national-five)
   added: (done-week-one stewart english national-five)
   changed: (duration) from 5880 to 6240
   goals met: 0 of 1
20. (do-week-two stewart english national-five)
   added: (done-week-two stewart english national-five)
   changed: (duration) from 6240 to 6600
   goals met: 0 of 1
21. (do-week-three stewart english national-five)
   added: (done-week-three stewart english national-five)
   changed: (duration) from 6600 to 6960
   goals met: 0 of 1
22. (do-week-four stewart english national-five)
   added: (done-week-four stewart english national-five)
   changed: (duration) from 6960 to 7320
   goals met: 0 of 1
23. (do-week-five stewart english national-five)
   added: (done-week-five stewart english national-five)
   changed: (duration) from 7320 to 7680
   goals met: 0 of 1
24. (do-week-six stewart english national-five)
   added: (done-week-six stewart english national-five)
   changed: (duration) from 7680 to 8040
   goals met: 0 of 1
25. (do-week-seven stewart english national-five)
   added: (done-week-seven stewart english national-five)
   changed: (duration) from 8040 to 8400
   goals met: 0 of 1
26. (do-week-eight stewart english national-five)
   added: (done-week-eight stewart english national-five)
   changed: (duration) from 8400 to 8760
   goals met: 0 of 1
27. (take-unit-three stewart english national-five)
   deleted: (done-week-eight stewart english national-five) (done-week-seven stewart english national-five) (done-week-six stewart english national-five) (done-week-five stewart english national-five) (done-week-four stewart english national-five) (done-week-three stewart english national-five) (done-week-two stewart english national-five) (done-week-one stewart english national-five)
   added: (done-unit-three stewart english national-five)
   changed: (duration) from 8760 to 8820
   goals met: 0 of 1
28. (do-week-one stewart english national-five)
   added: (done-week-one stewart english national-five)
   changed: (duration) from 8820 to 9180
   goals met: 0 of 1
29. (do-week-two stewart english national-five)
   added: (done-week-two stewart english national-five)
   changed: (duration) from 9180 to 9540
   goals met: 0 of 1
30. (do-week-three stewart english national-five)
   added: (done-week-three stewart english national-five)
   changed: (duration) from 9540 to 9900
   goals met: 0 of 1
31. (do-week-four stewart english national-five)
   added: (done-week-four stewart english national-five)
   changed: (duration) from 9900 to 10260
   goals met: 0 of 1
32. (do-week-five stewart english national-five)
   added: (done-week-five stewart english national-five)
   changed: (duration) from 10260 to 10620
   goals met: 0 of 1
33. (do-week-six stewart english national-five)
   added: (done-week-six stewart english national-five)
   changed: (duration) from 10620 to 10980
   goals met: 0 of 1
34. (do-week-seven stewart english national-five)
   added: (done-week-seven stewart english national-five)
   changed: (duration) from 10980 to 11340
   goals met: 0 of 1
35. (do-week-eight stewart english national-five)
   added: (done-week-eight stewart english national-five)
   changed: (duration) from 11340 to 11700
   goals met: 0 of 1
36. (take-unit-four stewart english national-five)
   deleted: (done-week-eight stewart english national-five) (done-week-seven stewart english national-five) (done-week-six stewart english national-five) (done-week-five stewart english national-five) (done-week-four stewart english national-five) (done-week-three stewart english national-five) (done-week-two stewart english national-five) (done-week-one stewart english national-five)
   added: (done-unit-four stewart english national-five)
   changed: (duration) from 11700 to 11760
   goals met: 0 of 1
37. (finish-course stewart english national-five)
   added: (finished-course stewart english national-five)
   goals met: 1 of 1
